README.org
#+TITLE: CV | Resume: thapakazi
#+DATE: Tuesday, Dec 20 2016
#+AUTHOR: Milan Thapa
#+OPTIONS: num:nil toc:nil H:3
#+OPTIONS: author:nil date:nil title:nil

# Fun stuffs
#+SEQ_TODO: ❢ ☯ ⚙ ✍ ⧖ | ☺ ✔ ⌚ ✘

# ########################################
# #### latex stuffs
# ########################################
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [12pt,a4paper]
# #+LaTeX_CLASS_OPTIONS: [article,letterpaper,times,12pt,listings-bw,microtype]
#+LATEX_HEADER: \usepackage[scaled=.875]{inconsolata}

# spacing between the lines
#+LATEX_HEADER: \linespread{1.25}
# TODO: fixme, this might not be needed
# #+LATEX_HEADER: \usepackage{setspace}
# #+LATEX_HEADER: \singlespacing

# Fix the margins
#+LATEX_HEADER: \usepackage[margin=0.75in]{geometry}

# For alternative coloring of table rows
#+LATEX_HEADER: \usepackage[table]{xcolor}
#+LATEX_HEADER: \usepackage[table]{xcolor}
#+LATEX_HEADER: \definecolor{lightblue}{rgb}{0.93,0.95,1.0}
#+LATEX_HEADER: \let\oldtabular\tabular
#+LATEX_HEADER: \let\endoldtabular\endtabular
#+LATEX_HEADER: \renewenvironment{tabular}{\rowcolors{2}{white}{lightblue}\oldtabular}{\endoldtabular}
#+LATEX_HEADER: \renewcommand\labelitemi{\tiny$\bullet$}

# ########################################
# ### custom header
# ########################################
#+begin_latex
\setcounter{secnumdepth}{-1}
\noindent
  \renewcommand{\rmdefault}{ptm}\normalfont\upshape
  \hspace{-.3cm}
  \huge Milan Thapa\\
  \large \href{https://thapakazi.github.io}{thapakazi\^}, linuxaddict, emacs aficionado \\
\href{mailto:oemilan@gmail.com}{oemilan@gmail.com}, +977 9841 715 750\\
 [[https://goo.gl/maps/zgMMxMqWadu][^]] Kavrepalanchok, Nepal, https://thapakazi.github.io
\hrule\vspace{.2cm}
#+end_latex

# # This line makes lists work better:
# It eliminates whitespace before/within a list and pushes it tt the left margin
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlist[enumerate,itemize]{nolistsep}


# credits: https://tex.stackexchange.com/a/108747
# syntax:  \titlespacing*{<command>}{<left>}{<before-sep>}{<after-sep>}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \titlespacing*{\section}{1ex}{0ex}{.5ex}
#+LATEX_HEADER: \titlespacing*{\subsection} {0pt}{1.5ex plus 1ex minus .2ex}{1.3ex plus .2ex}

# * my info
#   :PROPERTIES:
#   :TITLE:    My Resume
#   :HUGO_TAGS: cv, resume, self
#   :HUGO_TOPICS:
#   :HUGO_FILE: about_me.md
#   :HUGO_DATE: [2019-01-26 Sat 18:19]
#   :END:

** career | summary
   - *7+yrs operation journey*
     - shipping application runtimes over AWS, GCP, Linode with ~IAC Automation~
     - services ~instrumentation~ (over prometheus-grafana, slack alerts)
     - ~site reliability~; high availability{clustering,replica,scaling}
     - ~continuous delivery~ with build pipelines (github, jenkins, gitlab...)
     - ~security~: patching vms, hardening os/services
     - ~debugging~, recusing production, exec graceful service rollouts 
     - capacity planning & infrastructure provisioning
   - *2+yrs development journey*
     - build service/apis (~go,ruby~), cli tools (~bash/go~) & web-ui (~js~)
     - build dapps(react-native) on ethereum blockchain with solidity/truffle
   - *misc*
     - help companies simplify operational chores, mentor teams 
     - help organize community meetups: [[https://www.meetup.com/DevOps-Kathmandu/][DevOps-Kathmandu^]]
     - advocate [[https://12factor.net/][12factorapp^]] development principle
     - collaborate with open-source folks, [[https://thapakazi.github.io/info/tracking_the_digital_traces/][more info...^]]

** involvements
   + *jobs:*
     * [2019-2020] DevOps as Service contractor, toptal:[[https://www.toptal.com/resume/milan-thapa][profile^]], upwork:[[https://www.upwork.com/freelancers/~0157f8deb65a74ee15][profile^]]
     * [2018-2019] Developer-Manager, DevOps Engineer @[[https://www.whitehatengineering.com/][WhiteHatEngineering^]]
     * [2013-2018] ~5 yrs of work experience as *devops engineer* @[[https://www.cloudfactory.com][cloudfactory.com^]]
   + *academic:*
     B.E. in Computer Engineering from [[http://ku.edu.np/][Kathmandu University^]]
** projects
   - [[https://dibya.org][dibya.org]]: ~/in progress:/~ software development mentorship platform
     - role: owner, fullstack (react-redux, rails-api, postgres)
   # - payment utility mobile dapp, built upon the top of ethereum (client project)
   #   - built on golang (api: buffalo & custom framework, cli: cobra)
   #   # - designed as microsevices (kyc: user, dwolla, exchange, geth) 
   #   - client application: cli(go), mobile (react-native)
   - ~Others~: involved community projects like [[https://github.com/contribsys/faktory/pull/197][faktory]] and [[https://thapakazi.github.io/info/tracking_the_digital_traces/][more...]]

** Companies(#yrs):
   - Cloudfactory(4.8)- learned devOps culutre and simplified operational chores
   - Whitehat Engineering (1)- golang developer, infra guy
   - Enliv(2) - Mentor, Developer  
   - InnovaTech(1) - Site Reliability Engineering
   - Misc: 5+ companies around world - with DevOps as Service offerings
     
** in gist I love to
   - *automate* all the things #lazyme and define everything as code/textfile.
   - build simple, maintainable solutions to problem, and iteratively evolve.
   - explore and learn dope internals of a language(golang), frameworks
   - *instrumentation* services(business metrics/stats over graphs/charts); understand their behavior for continuous improvements.
   - *implementing best practices* for operational & development excellence
   - *build / use / suggest awesome tools* to others and enhance efforts on development-to-deployment workflow
   - *[[https://thapakazi.github.io/info/tracking_the_digital_traces/][collaborate with community via open src projects^]]*, report issues / PR :)
   - *share and learn* (organise and participate on community events, publish: [[https://thapakazi.github.io/][blogs]]/[[https://www.youtube.com/channel/UCKoZYAVhKjR9pB6Kg5fBDvQ][youtube]])
   # - practice literate *devops* via my favorite editor: EMACS
   # - communicate my solutions via project management tools (in github/trello)

** skills
  #+LATEX: \arrayrulecolor[gray]{.9}
  #+LATEX: \vspace{-3ex}

    | <16>             | <20>                        | <25>                        |
    |                  | *proficiency*               | *knows*                     |
    |------------------+-----------------------------+-----------------------------|
    | *containers*     | kubernetes <3 (CKA/CKAD)    | docker-compose              |
    | *iac*            | terraform,                  | packer, cloudFormation      |
    | *automation*     | ansible, capistrano         |                             |
    | *lib/frameworks* | react, rails, buffalo       | sinatra                     |
    | *languages*      | golang <3, sh , ruby        | c, js, python, c            |
    | *aws*            | EKS, EC2, S3, IAM, RDS      | DynamoDB, ElastiCache       |
    | *gcp*            | k8s, codebuild,dbs,compute  | Storage/Buckets             |
    | *database*       | mongodb, postgresql /(ops)/ | redis, mysql, percona tools |
    |------------------+-----------------------------+-----------------------------|
    | *monitoring*     | prometheus, sensu           | newrelic, +nagios+          |
    | *ci/cd*          | github/gitlab, jenkins,  | travis, circleci            |
    |------------------+-----------------------------+-----------------------------|
    | *blockchain*     | truffle                     | ethereum:SmartContracts     |
    |------------------+-----------------------------+-----------------------------|
    | *typeset*        | org-mode, md                | latex                       |
    | *editor*         | emacs                       | vim, nano                   |
    | *system*         | archlinux                   | debains, +windows/mac+      |
    | *speech*         | Nepali, English             | Hindi                       |
    |------------------+-----------------------------+-----------------------------|
** ops works | I enjoy doing
    - Pack and ship apps inside containers and pet them as cattle
    - AWS-EC2 *autoscaling* based business metrics 
    - Improve HA (replica/failover) for production services 
    # - Volume managements with lvm/raid
    # - Databases(mongo,mysql,pg,redis) backups via old ways of dump/restore.
    - Loudmouth security as a *F-word*. First, Foremost, Fundamental & Forever requirement.
    - Pull out hardcoded secrets/credentials in code into ENVIRONMENT variables :)
	- Simplify application deployment pipelines, make it easy and continuous
    # - SSL deployments {webserver, dbservers, rabbitmq}
    # - AWS resources management (S3buckets, IAM, Route53,VPC)

** good old memories/hobbies
 - hackathon victories: [[https://www.facebook.com/lipi.the.script/][Team Lipi^]] , #[[https://github.com/haude/osm2threejs][osm2threejs^]] 
   # + 2015, :: [[https://www.facebook.com/lipi.the.script/][Team Lipi^]] #tourism *Ncell App Challanges*
   # + 2016, :: Team Haude #[[https://github.com/haude/osm2threejs][osm2threejs^]] *Leapfrog Hackathon*
 # - Non silicon valley challenges:
 #   + 2013, :: Invigilator in poll-booth for country's constitution election
 - hobbies: playing with pi for fun; strumming guitar, futsal, kickboxing, marathon
    # - raspberri-pi (used mostly as mpd,alarmclocks,file-sharing, staging tests) 
    # - playing with arduino [[https://github.com/open-weather/][dream_project^]]
 # - #recent tinkering: playing with kubernetes#eks, build simple stupid utils{[[https://gitlab.com/thapakazi/sync-songs][sync-music]],[[https://github.com/thapakazi/easyssh-go][easyssh-go]]}
