README.md
<div class="latex" id="org99e5778">
<p>
\setcounter{secnumdepth}{-1}
\noindent
  \renewcommand{\rmdefault}{ptm}\normalfont\upshape
  \hspace{-.3cm}
  \huge Milan Thapa<br />
  \large \href{https://thapakazi.github.io}{thapakazi\^}, linuxaddict, emacs aficionado <br />
\href{mailto:oemilan@gmail.com}{oemilan@gmail.com}, +977 9841 715 750<br />
 <a href="https://goo.gl/maps/zgMMxMqWadu">^</a> Kavrepalanchok, Nepal, <a href="https://thapakazi.github.io">https://thapakazi.github.io</a>
\hrule\vspace{.2cm}
</p>

</div>


# career | summary

-   **7+yrs operation journey**
    -   shipping application runtimes over AWS, GCP, Linode with `IAC Automation`
    -   services `instrumentation` (over prometheus-grafana, slack alerts)
    -   `site reliability`; high availability{clustering,replica,scaling}
    -   `continuous delivery` with build pipelines (github, jenkins, gitlab&#x2026;)
    -   `security`: patching vms, hardening os/services
    -   `debugging`, recusing production, exec graceful service rollouts
    -   capacity planning & infrastructure provisioning
-   **2+yrs development journey**
    -   build service/apis (`go,ruby`), cli tools (`bash/go`) & web-ui (`js`)
    -   build dapps(react-native) on ethereum blockchain with solidity/truffle
-   **misc**
    -   help companies simplify operational chores, mentor teams
    -   help organize community meetups: [DevOps-Kathmandu^](https://www.meetup.com/DevOps-Kathmandu/)
    -   advocate [12factorapp^](https://12factor.net/) development principle
    -   collaborate with open-source folks, [more info&#x2026;^](https://thapakazi.github.io/info/tracking_the_digital_traces/)


# involvements

-   **jobs:**
    -   [2019-2020] DevOps as Service contractor, toptal:[profile^](https://www.toptal.com/resume/milan-thapa), upwork:[profile^](https://www.upwork.com/freelancers/~0157f8deb65a74ee15)
    -   [2018-2019] Developer-Manager, DevOps Engineer @[WhiteHatEngineering^](https://www.whitehatengineering.com/)
    -   [2013-2018] ~5 yrs of work experience as **devops engineer** @[cloudfactory.com^](https://www.cloudfactory.com)
-   **academic:**
    B.E. in Computer Engineering from [Kathmandu University^](http://ku.edu.np/)


# projects

-   [dibya.org](https://dibya.org): `/in progress:/` software development mentorship platform
    -   role: owner, fullstack (react-redux, rails-api, postgres)

-   `Others`: involved community projects like [faktory](https://github.com/contribsys/faktory/pull/197) and [more&#x2026;](https://thapakazi.github.io/info/tracking_the_digital_traces/)


# Companies(#yrs):

-   Cloudfactory(4.8)- learned devOps culutre and simplified operational chores
-   Whitehat Engineering (1)- golang developer, infra guy
-   Enliv(2) - Mentor, Developer
-   InnovaTech(1) - Site Reliability Engineering
-   Misc: 5+ companies around world - with DevOps as Service offerings


# in gist I love to

-   **automate** all the things #lazyme and define everything as code/textfile.
-   build simple, maintainable solutions to problem, and iteratively evolve.
-   explore and learn dope internals of a language(golang), frameworks
-   **instrumentation** services(business metrics/stats over graphs/charts); understand their behavior for continuous improvements.
-   **implementing best practices** for operational & development excellence
-   **build / use / suggest awesome tools** to others and enhance efforts on development-to-deployment workflow
-   **[collaborate with community via open src projects^](https://thapakazi.github.io/info/tracking_the_digital_traces/)**, report issues / PR :)
-   **share and learn** (organise and participate on community events, publish: [blogs](https://thapakazi.github.io/)/[youtube](https://www.youtube.com/channel/UCKoZYAVhKjR9pB6Kg5fBDvQ))


# skills

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b>proficiency</b></th>
<th scope="col" class="org-left"><b>knows</b></th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><b>containers</b></td>
<td class="org-left">kubernetes &lt;3 (CKA/CKAD)</td>
<td class="org-left">docker-compose</td>
</tr>


<tr>
<td class="org-left"><b>iac</b></td>
<td class="org-left">terraform,</td>
<td class="org-left">packer, cloudFormation</td>
</tr>


<tr>
<td class="org-left"><b>automation</b></td>
<td class="org-left">ansible, capistrano</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left"><b>lib/frameworks</b></td>
<td class="org-left">react, rails, buffalo</td>
<td class="org-left">sinatra</td>
</tr>


<tr>
<td class="org-left"><b>languages</b></td>
<td class="org-left">golang &lt;3, sh , ruby</td>
<td class="org-left">c, js, python, c</td>
</tr>


<tr>
<td class="org-left"><b>aws</b></td>
<td class="org-left">EKS, EC2, S3, IAM, RDS</td>
<td class="org-left">DynamoDB, ElastiCache</td>
</tr>


<tr>
<td class="org-left"><b>gcp</b></td>
<td class="org-left">k8s, codebuild,dbs,compute</td>
<td class="org-left">Storage/Buckets</td>
</tr>


<tr>
<td class="org-left"><b>database</b></td>
<td class="org-left">mongodb, postgresql <i>(ops)</i></td>
<td class="org-left">redis, mysql, percona tools</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left"><b>monitoring</b></td>
<td class="org-left">prometheus, sensu</td>
<td class="org-left">newrelic, <del>nagios</del></td>
</tr>


<tr>
<td class="org-left"><b>ci/cd</b></td>
<td class="org-left">github/gitlab, jenkins,</td>
<td class="org-left">travis, circleci</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left"><b>blockchain</b></td>
<td class="org-left">truffle</td>
<td class="org-left">ethereum:SmartContracts</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left"><b>typeset</b></td>
<td class="org-left">org-mode, md</td>
<td class="org-left">latex</td>
</tr>


<tr>
<td class="org-left"><b>editor</b></td>
<td class="org-left">emacs</td>
<td class="org-left">vim, nano</td>
</tr>


<tr>
<td class="org-left"><b>system</b></td>
<td class="org-left">archlinux</td>
<td class="org-left">debains, <del>windows/mac</del></td>
</tr>


<tr>
<td class="org-left"><b>speech</b></td>
<td class="org-left">Nepali, English</td>
<td class="org-left">Hindi</td>
</tr>
</tbody>
</table>


# ops works | I enjoy doing

-   Pack and ship apps inside containers and pet them as cattle
-   AWS-EC2 **autoscaling** based business metrics
-   Improve HA (replica/failover) for production services

-   Loudmouth security as a **F-word**. First, Foremost, Fundamental & Forever requirement.
-   Pull out hardcoded secrets/credentials in code into ENVIRONMENT variables :)
-   Simplify application deployment pipelines, make it easy and continuous


# good old memories/hobbies

-   hackathon victories: [Team Lipi^](https://www.facebook.com/lipi.the.script/) , #[osm2threejs^](https://github.com/haude/osm2threejs)

-   hobbies: playing with pi for fun; strumming guitar, futsal, kickboxing, marathon

